# Schema Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Schema Methods
Schema Class See Also
---
The Schema type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetField | Gets a Field of a given name from the Schema. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ListFields | The complete list of fields in the Schema, sorted by name. |
| ListSchemas | Lists all schemas in memory. |
| Lookup | Finds the Schema corresponding to the GUID in memory. |
| ReadAccessGranted | Checks whether Entities of this Schema may be retrieved by the current add-in. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| WriteAccessGranted | Checks whether Entities of this Schema may be stored by the current add-in. |

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace